# Laba 1

## Кружка

| Вид тестирования | Краткое определение вида тестирования | Тестовые проверки |
|----------------|---------|----------------|
| Functional Testing | Тестирование, основанное на сравнительном анализе спецификации и функциональности компонента или системы |  |
|Safety Testing | Тестирование продукта с целью определить его способность при использовании оговоренным образом оставаться в рамках приемлемого риска причинения вреда здоровью,бизнесу, программам, собственности или окружающей среде || 
|Security Testing |Тестирование с целью оценить защищенность программного продукта от внешних воздействий|  |
|Compatibility Testing |Проверка работоспособности приложения в различных средах| |
|GUI Testing|Тестирование, выполняемое путем взаимодействия с системой через графический интерфейс пользователя| |
|Usability Testing|Тестирование с целью определения степени понятности, легкости в изучении и использовании, привлекательности программного продукта для пользователя при условии использования в заданных условиях эксплуатации| |
|Accessibility Testing|Тестирование, которое определяет степень легкости, с которой пользователи с ограниченными способностями могут использовать систему или ее компоненты| |
|Internationalization|Тестирование адаптации продукта к языковым и культурным особенностям целого ряда регионов, в которых потенциально может использоваться продукт| Будет ли иностранцу также удобно пользоваться данной техникой |
| Testing|Вид тестирования производительности, проводимый с целью оценки поведения компонента или системы при возрастающей нагрузке| |
|Performance Testing|Вид тестирования производительности, оценивающий систему или компонент на граничных значениях рабочих нагрузок или за их пределами||
|Stress Testing|Вид тестирования производительности, оценивающий систему или компонент на граничных значениях рабочих нагрузок или за их пределами||
| Negative Testing|Тестирование неккоректных сценариев| |
|Black Box Testing|Тестирование системы без знания внутренней структуры и компонентов системы| |
| Automated Testing| Набор техник, подходов и инструментальных средств, позволяющий исключить человека из выполнения некоторых задач в процессе тестирования||
| Unit/Component Testing|Тестируются отдельные части (модули) системы||
| Integration Testing|Тестируется взаимодействие между отдельными модулями||
  

    
    
